r = int(input())
n = int(input())
a = [1, 5, 3, 5, 6, 3, 1, 5, 7, 8, 2, 3, 6, 8, 9, 8, 1, 2,
     4, 5, 1, 5, 1, 4, 5, 4, 5, 6, 7, 11, 23,
     523, 53, 45, 34, 3,
     123, 3, 12, 12, 3, 312, 312, 55, 23,
     14, 5, 23, 643, 2, 34, 53,
     12, 4, 3, 24, 52, 525, 12]
min_value = abs(r - (a[0] + a[1]))
i_min = 1
for i in range(2, n):
    d_tmp = abs(r - (a[i - 1] + a[i]))  # временный минимум
    if min_value > d_tmp:
        d_min = d_tmp
        i_min = i
print(a[i_min - 1], ",", a[i_min])
# Дано число R и массив A размера N. Найти два соседних элемента массива,
# сумма которых наиболее близка к числу R (то есть такой элемент 𝐴𝑘,
# для которого величина |𝐴𝑘−𝑅| является минимальной), и вывести эти элементы в
# порядке возрастания их индексов.
